app/views/chats/new.html.erb

<% @chats.each do |chat| %>
<%= chat.user.first_name %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]