app/controllers/chats_controller.rb

  def index
    @chats = Chat.all
---
SELECT "chats".* FROM "chats"

  def new
    # binding.pry
    @chats =Chat.all
---
SELECT "chats".* FROM "chats"

  def create
    @chat = current_user.chats.new(chat_params)

    respond_to do |format|
      if @chat.save
---
INSERT INTO "chats" ("message", "created_at", "updated_at", "user_id", "email") VALUES (?, ?, ?, ?, ?)  [["message", "Hello"], ["created_at", "2020-11-03 16:50:00.552215"], ["updated_at", "2020-11-03 16:50:00.552215"], ["user_id", 9], ["email", "test@test.com"]]

  def update
    respond_to do |format|
      if @chat.update(chat_params)
---
UPDATE "chats" SET "message" = ?, "updated_at" = ? WHERE "chats"."id" = ?  [["message", "yesq"], ["updated_at", "2020-11-03 16:48:01.523938"], ["id", 121]]

  def destroy
    # @chat.destroy
    current_user.chats.find(params[:id]).destroy
---
DELETE FROM "chats" WHERE "chats"."id" = ?  [["id", 119]]
SELECT "chats".* FROM "chats" WHERE "chats"."user_id" = ? AND "chats"."id" = ? LIMIT ?  [["user_id", 7], ["id", 119], ["LIMIT", 1]]

    def set_chat
      @chat = current_user.chats.find(params[:id])
---
SELECT "chats".* FROM "chats" WHERE "chats"."user_id" = ? AND "chats"."id" = ? LIMIT ?  [["user_id", 7], ["id", 121], ["LIMIT", 1]]